# Merging DataFrames

In [2]:
import pandas as pd
df = pd.DataFrame([{'Name':'Kevin','Item_Purchased':'Chocolates','Cost':3.50},
                  {'Name':'Angela','Item_Purchased':'Kitty Litter','Cost':9.50},
                  {'Name':'Jim','Item_Purchased':'Ring','Cost':50.00}],
                 index=['Store 1','Store 1','Store 2'])
df

         Cost Item_Purchased    Name
Store 1   3.5     Chocolates   Kevin
Store 1   9.5   Kitty Litter  Angela
Store 2  50.0           Ring     Jim

In [4]:
df['Date'] = ['Dec 1', 'Jan 1','Mid May']
df

         Cost Item_Purchased    Name     Date
Store 1   3.5     Chocolates   Kevin    Dec 1
Store 1   9.5   Kitty Litter  Angela    Jan 1
Store 2  50.0           Ring     Jim  Mid May

In [5]:
df['Delivered']=True

In [6]:
df

         Cost Item_Purchased    Name     Date  Delivered
Store 1   3.5     Chocolates   Kevin    Dec 1       True
Store 1   9.5   Kitty Litter  Angela    Jan 1       True
Store 2  50.0           Ring     Jim  Mid May       True

In [7]:
df['FeedBack'] = ['Positive',None,'Negative']
df

         Cost Item_Purchased    Name     Date  Delivered  FeedBack
Store 1   3.5     Chocolates   Kevin    Dec 1       True  Positive
Store 1   9.5   Kitty Litter  Angela    Jan 1       True      None
Store 2  50.0           Ring     Jim  Mid May       True  Negative

In [8]:
adf = df.reset_index()
adf

     index  Cost Item_Purchased    Name     Date  Delivered  FeedBack
0  Store 1   3.5     Chocolates   Kevin    Dec 1       True  Positive
1  Store 1   9.5   Kitty Litter  Angela    Jan 1       True      None
2  Store 2  50.0           Ring     Jim  Mid May       True  Negative

In [21]:
adf['Date'] = pd.Series({0:'Dec 1',2:'Mid May'})
adf

     index  Cost Item_Purchased    Name     Date  Delivered  FeedBack
0  Store 1   3.5     Chocolates   Kevin    Dec 1       True  Positive
1  Store 1   9.5   Kitty Litter  Angela      NaN       True      None
2  Store 2  50.0           Ring     Jim  Mid May       True  Negative